fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ВКМ_НачисленияЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачисленияЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПроцентОтРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВводОтпуска/ВКМ_ВводОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВводОтпуска</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
    <items>
      <name>ПроцентОтРабот</name>
      <description>Процент от работ</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЗаполнитьДвиженияНачислений();
	ЗаполнитьДвиженияВзаиморасчетов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСписокСотрудников() Экспорт
	
	НачалоПериода = НачалоМесяца(Дата);
	КонецПериода  = КонецМесяца(Дата);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", НачалоПериода);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Сотрудник КАК Сотрудник,
	|	Т.Оклад КАК Оклад,
	|	Т.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК Т
	|ГДЕ
	|	Т.Оклад > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗапросРаботы = Новый Запрос;
	ЗапросРаботы.УстановитьПараметр("НачалоПериода", НачалоПериода);
	ЗапросРаботы.УстановитьПараметр("КонецПериода",  КонецПериода);
	ЗапросРаботы.Текст =
	"ВЫБРАТЬ
	|	Т.Сотрудник КАК Сотрудник,
	|	СУММА(Т.СуммаКОплате) КАК СуммаКОплате
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы КАК Т
	|ГДЕ
	|	Т.Период >= &НачалоПериода
	|	И Т.Период <= &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Сотрудник";
	
	ТаблицаРабот = ЗапросРаботы.Выполнить().Выгрузить();
	
	ЗапросОтпусков = Новый Запрос;
	ЗапросОтпусков.УстановитьПараметр("НачалоПериода", НачалоПериода);
	ЗапросОтпусков.УстановитьПараметр("КонецПериода",  КонецПериода);
	ЗапросОтпусков.Текст =
	"ВЫБРАТЬ
	|	Т.Сотрудник КАК Сотрудник,
	|	Т.ДатаНачала КАК ДатаНачала,
	|	Т.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.ВКМ_ВводОтпуска КАК Т
	|ГДЕ
	|	Т.Проведен = ИСТИНА
	|	И Т.ДатаНачала <= &КонецПериода
	|	И Т.ДатаОкончания >= &НачалоПериода";
	
	ТаблицаОтпусков = ЗапросОтпусков.Выполнить().Выгрузить();
	
	РабДнейВМесяце = РабочихДнейВПериоде(НачалоПериода, КонецПериода);
	
	СписокСотрудников.Очистить();
	
	КоэффициентНДФЛ = Константы.ВКМ_ПроцентНДФЛ.КоэффициентНДФЛ();
	
	Пока Выборка.Следующий() Цикл
		
		Строка = СписокСотрудников.Добавить();
		Строка.Сотрудник = Выборка.Сотрудник;
		
		СтрОтпуска  = ТаблицаОтпусков.НайтиСтроки(Новый Структура("Сотрудник", Выборка.Сотрудник));
		Если СтрОтпуска.Количество() > 0 И РабДнейВМесяце > 0 Тогда
			
			РабДнейОтпуска = 0;
			Для Каждого СтрОтп Из СтрОтпуска Цикл
				ДатаНачОтп = Макс(СтрОтп.ДатаНачала, НачалоПериода);
				ДатаКонОтп = Мин(СтрОтп.ДатаОкончания, КонецПериода);
				Если ДатаНачОтп <= ДатаКонОтп Тогда
					РабДнейОтпуска = РабДнейОтпуска + РабочихДнейВПериоде(ДатаНачОтп, ДатаКонОтп);
				КонецЕсли;
			КонецЦикла;
			
			ДнейРаботы   = РабДнейВМесяце - РабДнейОтпуска;
			Строка.Оклад = Окр(Выборка.Оклад * ДнейРаботы / РабДнейВМесяце, 2);
			
		Иначе
			Строка.Оклад = Выборка.Оклад;
		КонецЕсли;
		
		СтрокиРабот = ТаблицаРабот.НайтиСтроки(Новый Структура("Сотрудник", Выборка.Сотрудник));
		Если СтрокиРабот.Количество() > 0 Тогда
			Строка.СуммаПроцентОтРабот = СтрокиРабот[0].СуммаКОплате;
		КонецЕсли;
		
		Строка.НДФЛ = Окр((Строка.Оклад + Строка.СуммаПроцентОтРабот) * КоэффициентНДФЛ, 2);
		
	КонецЦикла;
	
КонецПроцедуры

Функция РабочихДнейВПериоде(ДатаНач, ДатаКон)
	
	КолДней     = 0;
	ТекДата     = НачалоДня(ДатаНач);
	ДатаКонДень = НачалоДня(ДатаКон);
	
	Пока ТекДата <= ДатаКонДень Цикл
		
		НДН = ДеньНедели(ТекДата);
		Если НДН < 6 Тогда
			КолДней = КолДней + 1;
		КонецЕсли;
		
		ТекДата = ТекДата + 86400;
		
	КонецЦикла;
	
	Возврат КолДней;
	
КонецФункции

Процедура ЗаполнитьДвиженияНачислений()
	
	ПланОклад   = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад;
	ПланПроцент = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентОтРабот;
	ПланНДФЛ    = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
	
	НачалоПериода = НачалоМесяца(Дата);
	КонецПериода  = КонецМесяца(Дата);
	
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_ОсновныеНачисления.Очистить();
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_Удержания.Очистить();
	
	Для Каждого Строка Из СписокСотрудников Цикл
		
		Если Строка.Оклад <> 0 Тогда
			
			ДвиженияОклад = Движения.ВКМ_ОсновныеНачисления.Добавить();
			ДвиженияОклад.ПериодРегистрации = НачалоПериода;
			ДвиженияОклад.ВидРасчета        = ПланОклад;
			ДвиженияОклад.Сотрудник         = Строка.Сотрудник;
			ДвиженияОклад.Результат         = Строка.Оклад;
			
		КонецЕсли;
		
		Если Строка.СуммаПроцентОтРабот <> 0 Тогда
			
			ДвиженияПроцент = Движения.ВКМ_ОсновныеНачисления.Добавить();
			
			ДвиженияПроцент.ПериодРегистрации = НачалоПериода;
			ДвиженияПроцент.ВидРасчета        = ПланПроцент;
			ДвиженияПроцент.Сотрудник         = Строка.Сотрудник;
			ДвиженияПроцент.Результат         = Строка.СуммаПроцентОтРабот;
			
		КонецЕсли;
		
		Если Строка.НДФЛ <> 0 Тогда
			
			ДвиженияНДФЛ = Движения.ВКМ_Удержания.Добавить();
			
			ДвиженияНДФЛ.ПериодРегистрации = НачалоПериода;
			ДвиженияНДФЛ.ВидРасчета        = ПланНДФЛ;
			ДвиженияНДФЛ.Сотрудник         = Строка.Сотрудник;
			ДвиженияНДФЛ.Результат         = Строка.НДФЛ;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДвиженияВзаиморасчетов()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	
	Для Каждого Строка Из СписокСотрудников Цикл
		
		СуммаКВыплате = Строка.Оклад + Строка.СуммаПроцентОтРабот - Строка.НДФЛ;
		Если СуммаКВыплате = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = Дата;
		Движение.Сотрудник   = Строка.Сотрудник;
		Движение.Сумма       = СуммаКВыплате;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
